In [4]:
import numpy as np
import pandas as pd

In [5]:
data = {
    'name': ["raju", "ravi", "ranjan", "rajesh"],
    'age': [18, 20, 21, 55],
    'Gender': ['M', 'M', 'M', 'M']
}

In [6]:
framedata = pd.DataFrame(data)

In [7]:
framedata

     name  age Gender
0    raju   18      M
1    ravi   20      M
2  ranjan   21      M
3  rajesh   55      M

In [8]:
framedata["age"]

0    18
1    20
2    21
3    55
Name: age, dtype: int64

###  create data frame using list

In [11]:
listdata = [
    ['raju',29,"cse"],
    ["rahul",21,"cse"],
    ["shivam",25,"agr"]
]
colomns = ["name","age","branch"]

In [18]:
data= pd.DataFrame(listdata ,columns = colomns)
data

     name  age branch
0    raju   29    cse
1   rahul   21    cse
2  shivam   25    agr

### select data

In [19]:
data['age']

0    29
1    21
2    25
Name: age, dtype: int64

In [20]:
data[["name","age"]]

     name  age
0    raju   29
1   rahul   21
2  shivam   25

### creating new colomns

In [21]:
data["course"] = ["B.tech","bca","agr"]

In [23]:
data

     name  age branch  course
0    raju   29    cse  B.tech
1   rahul   21    cse     bca
2  shivam   25    agr     agr

### Delete columns

In [26]:
data.drop("course",axis=1 ,inplace=True )## inplace true changeing perfoming
data.drop([ ])

In [27]:
data

     name  age branch
0    raju   29    cse
1   rahul   21    cse
2  shivam   25    agr